{
  "architecture": {
    "page": 2,
    "bbox": [
      74.88252258300781,
      660.1383209228516,
      593.3541564941406,
      771.3675842285156
    ],
    "caption": "Figure 2: The MedCoT pipeline begins with an Initial Specialist receiving a medical question and image to generate a preliminary rationale. This rationale may have flaws (indicated in red), which are then reviewed by theText Follow-up Text Specialist. If the rationale is deemed effective, it is retained; otherwise, it is reconsidered and a new rationale (indicated in green) is generated, along with an image caption. These elements are then integrated into the Diagnostic Specialist. Informed by all contexts, the Diagnostic Specialist, a multimodal language model with a designed sparse MoE structure, delivers the final diagnostic outcome (answer).",
    "file_name": [
      "figures/fileoutpart1.png"
    ],
    "output_file": "assets/images/paper/2412.13736_MedCoT Medical Chain of Thought via Hierarchical Expert/fig_03.png"
  },
  "results": {
    "page": 6,
    "bbox": [
      91.81900024414062,
      229.9265899658203,
      270.41624450683594,
      301.2445831298828
    ],
    "caption": "dicate that MedCoT consistently achieves SoTA results compared to the majority of SoTA methods.",
    "file_name": [
      "tables/fileoutpart17.xlsx",
      "tables/fileoutpart18.png"
    ],
    "output_file": "assets/images/paper/2412.13736_MedCoT Medical Chain of Thought via Hierarchical Expert/table_22.png"
  },
  "results_2": null,
  "markdown": "### Main Architecture\n![Architecture](/assets/images/paper/2412.13736_MedCoT Medical Chain of Thought via Hierarchical Expert/fig_03.png)\n캡션: Figure 2: The MedCoT pipeline begins with an Initial Specialist receiving a medical question and image to generate a preliminary rationale. This rationale may have flaws (indicated in red), which are then reviewed by theText Follow-up Text Specialist. If the rationale is deemed effective, it is retained; otherwise, it is reconsidered and a new rationale (indicated in green) is generated, along wit…\n\n### Main Results Table\n![Results](/assets/images/paper/2412.13736_MedCoT Medical Chain of Thought via Hierarchical Expert/table_22.png)\n캡션: dicate that MedCoT consistently achieves SoTA results compared to the majority of SoTA methods."
}